一
丁
七
丄
丅
万
丈
三
上
下
丌
不
与
丐
丑
专
且
丕
世
丘
丙
业
丛
东
丝
丞
丟
両
丢
两
严
並
丧
丨
丩
个
丫
丬
中
丰
串
临
丶
丸
丹
为
主
丼
丽
举
丿
乂
乃
久
乇
么
义
乊
之
乌
乍
乎
乏
乐
乒
乓
乔
乕
乖
乘
乙
乜
九
乞
也
习
乡
乣
书
乩
乬
乮
乯
买
乱
乳
乵
乸
乻
乾
亀
亂
亃
了
亇
予
争
亊
事
二
亍
于
亏
云
互
亓
五
井
亘
亚
些
亜
亝
亞
亟
亡
亢
交
亥
亦
产
亨
亩
享
京
亭
亮
亯
亱
亲
亳
亵
亶
亷
人
亻
亽
亿
什
仁
仂
仃
仄
仅
仆
仇
仉
今
介
仍
从
仏
仐
仑
仓
仔
仕
他
仗
付
仙
仝
仞
仟
仡
仢
代
令
以
仦
仨
仪
仫
们
仮
仰
仲
仴
仵
件
价
任
份
仾
仿
伀
企
伇
伉
伊
伍
伎
伏
伐
休
众
优
伙
会
伛
伝
伞
伟
传
伡
伢
伤
伥
伦
伧
伪
伫
伯
估
伱
伲
伴
伶
伸
伺
似
伽
佀
佃
但
佇
佈
位
低
住
佐
佑
体
何
佗
佘
余
佚
佛
作
佝
佞
佟
你
佡
佢
佣
佤
佥
佧
佩
佬
佭
佯
佰
佱
佳
佶
佷
佺
佻
佼
佾
使
侃
侄
來
侈
侉
侊
例
侍
侏
侐
侑
侒
侔
侖
侗
供
依
侠
価
侣
侥
侦
侧
侨
侩
侪
侫
侬
侮
侯
侵
侹
便
係
促
俄
俅
俆
俊
俎
俏
俐
俑
俒
俔
俗
俘
俙
俚
俜
保
俞
俟
俠
信
俢
俣
俤
俦
俨
俩
俪
俫
俬
俭
修
俯
俱
俳
俵
俶
俷
俸
俺
俾
倆
倉
個
倌
倍
倏
們
倒
倔
倗
倘
候
倚
倛
倜
倞
借
倠
倡
倢
値
倥
倦
倧
倨
倩
倪
倫
倬
倭
倮
倶
倷
债
倻
值
倾
偁
偃
偅
假
偈
偋
偌
偎
偏
偑
偓
偔
偕
做
停
偠
偢
偤
健
偦
偨
偬
偱
偲
偵
偶
偷
偸
偻
偾
偿
傀
傃
傅
傈
傍
傑
傘
備
傛
傜
傝
傣
傥
傦
傧
储
傩
催
傭
傲
傳
債
傷
傸
傺
傻
傾
傿
僅
働
僎
像
僕
僖
僙
僚
僛
僟
僦
僧
僭
僮
僰
僳
僵
僶
價
僻
僿
儀
儁
儂
儃
儆
儋
儒
儚
償
儡
優
儬
儴
儾
儿
兀
允
元
兄
充
兆
先
光
克
免
兎
児
兑
兒
兔
兕
兖
党
兜
兢
兤
入
兦
內
全
兩
八
公
六
兮
兯
兰
共
关
兴
兵
其
具
典
兹
养
兼
兽
冀
冁
内
円
冇
冈
冉
册
再
冏
冒
冓
冕
冖
冗
冘
写
冚
军
农
冞
冟
冠
冢
冣
冤
冥
冦
冧
冬
冯
冰
冱
冲
决
况
冶
冷
冹
冻
冼
冽
净
凂
凄
准
凇
凉
凊
凋
凌
减
凑
凕
凗
凛
凝
凞
几
凡
凣
凤
処
凩
凪
凫
凭
凮
凯
凰
凱
凳
凵
凶
凸
凹
出
击
凼
函
凿
刀
刁
刂
刃
分
切
刈
刊
刌
刍
刎
刑
划
刔
刕
刖
列
刘
则
刚
创
初
删
判
別
刧
刨
利
别
刮
刯
到
刳
制
刷
券
刹
刺
刻
刽
刾
刿
剀
剁
剂
剃
剆
則
剉
削
剌
前
剎
剐
剑
剒
剓
剔
剖
剚
剛
剜
剞
剡
剣
剥
剧
剩
剪
剬
剭
副
剰
割
創
剺
剽
剿
劆
劇
劈
劍
劏
劙
劚
力
劝
办
功
加
务
劢
劣
动
助
努
劫
劬
劭
劯
励
劲
劳
労
劵
劶
劷
効
劺
劻
劼
劾
势
勁
勃
勄
勇
勉
勊
勋
勍
勐
勒
動
勖
勘
務
勝
勞
募
勢
勤
勧
勨
勯
勰
勲
勳
勸
勺
勽
勾
勿
匀
匂
包
匆
匈
匊
匋
匍
匏
匐
匕
化
北
匙
匚
匝
匠
匡
匣
匤
匦
匪
匮
匲
匵
匶
匹
区
医
匾
匿
十
千
卄
卅
升
午
卉
半
华
协
卑
卒
卓
单
卖
南
単
博
卜
卞
卟
占
卡
卢
卣
卤
卦
卧
卪
卫
卬
卭
卮
卯
印
危
卲
即
却
卵
卷
卸
卾
卿
厂
厄
厅
历
厈
厉
压
厌
厍
厓
厕
厘
厚
厝
原
厢
厣
厥
厦
厨
厩
厪
厭
厮
厳
厶
厸
厹
去
县
叁
参
叅
又
叉
及
友
双
反
収
发
叔
取
受
变
叙
叛
叞
叟
叠
叡
口
古
句
另
叨
叩
只
叫
召
叭
叮
可
台
叱
史
右
叵
叶
号
司
叹
叻
叼
叽
吁
吃
各
吆
吇
合
吉
吊
吋
同
名
后
吏
吐
向
吒
吓
吔
吕
吖
吗
吙
君
吝
吞
吟
吠
吡
吥
否
吧
吨
吩
含
听
吭
吮
启
吱
吲
吳
吴
吵
吸
吹
吻
吼
吽
吾
呀
呂
呃
呅
呆
呈
呉
告
呋
呎
呐
呑
呒
呓
呔
呕
呖
呗
员
呙
呚
呛
呜
呝
呡
呢
呤
呥
呦
周
呩
呪
呮
呯
呱
呲
味
呴
呵
呶
呷
呸
呹
呻
呼
命
咀
咁
咂
咃
咄
咅
咆
咇
咋
和
咎
咏
咐
咒
咓
咔
咕
咖
咗
咙
咚
咛
咝
咠
咣
咤
咥
咦
咧
咨
咩
咪
咫
咬
咭
咯
咱
咲
咳
咴
咸
咻
咽
咿
哀
品
哂
哄
哆
哇
哈
哉
哋
哌
响
哎
哏
哐
哑
哒
哓
哔
哕
哗
哙
哚
哝
哞
哟
員
哣
哤
哥
哦
哧
哨
哩
哪
哫
哭
哮
哲
哳
哴
哺
哼
哽
哿
唁
唄
唅
唆
唇
唉
唍
唎
唏
唐
唑
唒
唔
唖
唛
唞
唠
唢
唤
唧
唨
唩
唬
售
唯
唰
唱
唳
唵
唷
唹
唻
唾
啀
啁
啃
啄
商
啉
啊
啌
問
啐
啓
啕
啖
啗
啚
啜
啞
啟
啡
啤
啥
啦
啧
啪
啫
啬
啭
啮
啯
啰
啱
啲
啵
啶
啷
啸
啻
啼
啽
啾
喀
喁
喂
喃
善
喆
喇
喉
喊
喋
喎
喏
喑
喔
喕
喘
喙
喚
喜
喝
喞
喟
喤
喦
喧
喪
單
喰
喱
喲
喳
喵
喷
喸
喹
喺
喻
喽
喾
喿
嗄
嗅
嗉
嗌
嗍
嗎
嗐
嗑
嗒
嗓
嗔
嗖
嗗
嗙
嗚
嗛
嗜
嗝
嗞
嗟
嗡
嗣
嗤
嗥
嗦
嗨
嗪
嗫
嗬
嗯
嗰
嗱
嗲
嗳
嗵
嗷
嗺
嗻
嗽
嗾
嘀
嘁
嘃
嘅
嘈
嘉
嘌
嘎
嘘
嘚
嘛
嘞
嘟
嘡
嘢
嘣
嘤
嘥
嘧
嘩
嘬
嘭
嘱
嘲
嘴
嘶
嘹
嘻
嘿
噁
噂
噈
噋
噌
噎
噑
噒
噔
噗
噘
噙
噚
噜
噢
噤
器
噩
噪
噫
噬
噭
噰
噱
噴
噶
噹
噺
噻
噼
噿
嚀
嚅
嚆
嚊
嚎
嚏
嚓
嚜
嚝
嚟
嚣
嚪
嚫
嚯
嚰
嚱
嚷
嚼
嚽
嚾
囃
囇
囊
囍
囓
囔
囗
囚
四
囝
回
囟
因
囡
团
団
囤
囥
囧
囫
园
囯
困
囱
囲
図
围
囵
囹
固
国
图
囿
圁
圂
圃
圄
圆
圇
圈
圉
國
圌
圏
園
圓
圕
圛
圜
圝
土
圣
圦
圧
在
圩
圪
圬
圭
圮
圯
地
圳
圴
圵
圹
场
圻
圽
圾
址
坂
均
坈
坊
坌
坍
坎
坏
坐
坑
块
坘
坚
坛
坜
坝
坞
坟
坠
坡
坢
坣
坤
坥
坦
坨
坩
坪
坬
坭
坯
坳
坵
坷
坻
坼
坿
垁
垂
垃
垄
垅
垆
垈
垊
型
垌
垏
垒
垓
垕
垘
垚
垛
垞
垠
垡
垢
垣
垥
垦
垩
垫
垭
垮
垯
垱
垲
垵
垸
垹
垾
垿
埂
埃
埈
埋
埌
城
埐
埑
埔
埕
埖
埗
埘
埙
埚
埛
埜
埝
域
埠
埤
埨
埬
埭
埯
埲
埵
執
埸
培
基
埻
埼
埽
埾
堀
堂
堃
堅
堆
堇
堋
堌
堍
堑
堔
堕
堙
堚
堞
堠
堡
堤
堪
堬
堰
報
場
堵
堽
塀
塆
塇
塌
塍
塑
塔
塘
塙
塚
塛
塝
塞
塟
塣
塥
塩
塪
填
塬
塮
塱
塵
塸
塾
墀
墁
境
墅
墈
墉
墋
墍
墎
墒
墓
増
墙
墚
墜
增
墟
墠
墢
墤
墧
墨
墩
墹
墻
墼
墽
壁
壅
壆
壈
壊
壑
壓
壕
壞
壤
士
壬
壮
声
壱
売
壳
壴
壶
壷
壸
壹
壺
壽
壾
壿
处
备
夈
変
复
夏
夑
夔
夕
外
夙
多
夜
够
夠
夢
夤
夥
大
天
太
夫
夭
央
夯
失
头
夷
夸
夹
夺
夻
夼
夾
奁
奂
奄
奇
奈
奉
奋
奎
奏
契
奒
奔
奕
奖
套
奘
奚
奠
奡
奢
奥
奪
奫
奭
奮
奯
奱
女
奴
奶
奸
她
奻
奼
好
妁
如
妃
妄
妆
妇
妈
妊
妋
妍
妏
妒
妓
妕
妖
妗
妘
妙
妝
妞
妠
妣
妤
妥
妨
妩
妪
妫
妬
妮
妯
妰
妲
妳
妵
妹
妺
妻
妾
姃
姆
姉
姊
始
姐
姑
姒
姓
委
姖
姗
姘
姚
姜
姝
姠
姣
姥
姦
姧
姨
姫
姬
姵
姹
姺
姻
姿
威
娃
娄
娅
娆
娇
娈
娉
娌
娏
娑
娓
娕
娖
娗
娘
娜
娟
娠
娢
娣
娥
娩
娬
娯
娰
娱
娲
娴
娶
娼
娽
娿
婀
婆
婇
婉
婊
婏
婐
婑
婓
婕
婚
婟
婠
婢
婦
婧
婪
婱
婳
婴
婵
婶
婷
婺
婿
媂
媅
媒
媕
媗
媚
媛
媝
媞
媤
媪
媲
媳
媷
媸
媹
媺
媽
媾
媿
嫁
嫂
嫇
嫈
嫉
嫋
嫌
嫍
嫒
嫔
嫖
嫘
嫚
嫜
嫟
嫠
嫡
嫣
嫤
嫥
嫦
嫩
嫫
嫬
嫰
嫱
嫲
嬂
嬅
嬉
嬊
嬌
嬎
嬖
嬗
嬛
嬠
嬢
嬣
嬤
嬥
嬩
嬰
嬲
嬴
嬶
嬷
嬹
嬿
孀
孁
孃
孄
孋
子
孑
孓
孔
孕
孖
字
存
孙
孚
孛
孜
孝
孟
孢
季
孤
学
孧
孩
孪
孫
孬
孭
孰
孱
孳
孴
孵
學
孺
孻
孽
孾
宁
它
宄
宅
宆
宇
守
安
宋
完
宏
宑
宓
宕
宗
官
宙
定
宛
宜
宝
实
実
宠
审
客
宣
室
宥
宦
宧
宨
宪
宫
宬
宮
宰
害
宴
宵
家
宸
容
宼
宽
宾
宿
寂
寄
寅
密
寇
寈
富
寐
寑
寒
寓
寗
寙
寛
寝
寞
察
寡
寤
寥
實
寧
寨
審
寫
寬
寮
寯
寰
寵
寶
寸
对
寺
寻
导
対
寿
尀
封
専
射
尅
将
將
尉
尊
尋
對
導
小
尐
少
尒
尓
尔
尕
尖
尘
尙
尚
尝
尢
尤
尥
尧
尪
尫
尬
尰
就
尴
尸
尹
尺
尻
尼
尽
尾
尿
局
屁
层
居
屈
屉
届
屋
屌
屍
屎
屏
屐
屑
屔
展
屙
屛
属
屠
屡
屣
層
履
屦
屬
屯
山
屲
屳
屶
屹
屺
屻
屾
屿
岀
岁
岂
岈
岌
岐
岑
岔
岖
岗
岘
岙
岚
岛
岜
岞
岠
岡
岢
岣
岦
岧
岩
岫
岬
岭
岱
岳
岵
岷
岸
岺
岽
岿
峀
峁
峂
峄
峇
峋
峍
峒
峓
峙
峜
峠
峡
峣
峤
峥
峦
峨
峪
峭
峯
峰
島
峸
峻
崁
崂
崃
崆
崇
崎
崑
崓
崔
崖
崗
崚
崛
崜
崞
崟
崤
崦
崧
崩
崭
崮
崯
崲
崴
崻
崽
崾
嵆
嵇
嵊
嵋
嵌
嵎
嵐
嵖
嵘
嵚
嵛
嵟
嵣
嵨
嵩
嵫
嵬
嵯
嵱
嵴
嶂
嶇
嶋
嶐
嶓
嶕
嶖
嶘
嶙
嶛
嶜
嶝
嶪
嶷
嶹
嶺
巅
巇
巉
巍
巘
川
州
巡
巢
巣
工
左
巧
巨
巩
巫
差
巯
己
已
巳
巴
巵
巷
巻
巽
巾
巿
币
市
布
帅
帆
帇
师
希
帏
帐
帑
帔
帕
帖
帗
帘
帙
帚
帛
帜
帝
帢
帣
带
帧
師
席
帮
帯
帰
帱
帴
帶
帷
常
帻
帼
帽
幁
幂
幄
幅
幈
幌
幍
幒
幔
幕
幙
幛
幟
幡
幢
幪
干
平
年
并
幷
幸
幹
幺
幻
幼
幽
幾
广
庀
庁
広
庄
庆
庇
庈
床
庋
庍
序
庐
庑
库
应
底
庖
店
庙
庚
府
庝
庞
废
庠
庣
庥
度
座
庫
庭
庮
庯
庵
庶
康
庸
庹
庾
廀
廃
廈
廉
廊
廋
廌
廑
廒
廓
廖
廘
廜
廟
廢
廣
廤
廦
廪
廮
廯
廴
延
廷
廸
建
廻
廾
廿
开
弁
异
弃
弄
弈
弊
弋
弌
式
弐
弑
弓
弔
引
弗
弘
弛
弞
弟
张
弢
弥
弦
弧
弩
弪
弫
弭
弯
弱
弴
張
弶
強
弸
弹
强
弼
弾
弿
彀
彄
彅
彈
彊
彌
彎
彑
归
当
录
彗
彘
彝
彟
形
彣
彤
彦
彧
彨
彩
彪
彬
彭
彰
影
彲
彳
彴
彶
彷
役
彻
彼
彿
往
征
徂
径
待
徇
很
徉
徊
律
後
徏
徐
徒
徔
徕
得
徘
徙
徚
徛
徜
從
御
徦
徨
復
循
徫
徬
徭
微
徯
徳
徴
徵
德
徸
徹
徽
徾
心
忄
必
忆
忉
忌
忍
忎
忏
忐
忑
忒
忖
志
忘
忙
応
忝
忞
忟
忠
忡
忢
忤
忧
忪
快
忭
忱
忲
念
忸
忻
忽
忾
忿
怀
态
怂
怃
怄
怅
怆
怍
怎
怏
怐
怒
怔
怕
怖
怙
怛
怜
思
怞
怟
怠
怡
急
怦
性
怨
怩
怪
怫
怯
怱
怵
怶
怸
怹
怺
总
怼
怿
恁
恂
恃
恅
恆
恋
恍
恏
恐
恒
恓
恔
恕
恙
恚
恢
恣
恤
恥
恦
恨
恩
恪
恫
恬
恭
息
恰
恳
恵
恶
恸
恹
恺
恻
恼
恽
恿
悃
悄
悈
悉
悌
悍
悎
悒
悔
悖
悗
悚
悜
悝
悟
悠
悢
患
悦
您
悩
悪
悫
悬
悭
悯
悱
悲
悴
悶
悸
悻
悼
悾
情
惆
惇
惊
惋
惌
惍
惎
惑
惓
惕
惗
惘
惚
惜
惟
惠
惡
惣
惦
惧
惨
惩
惫
惬
惭
惮
惯
惰
惱
想
惴
惶
惹
惺
愀
愁
愆
愈
愉
愋
愍
愎
意
愕
愗
愘
愚
愛
感
愠
愢
愣
愤
愥
愦
愧
愫
愬
愴
愿
慄
慆
慈
態
慌
慎
慑
慒
慕
慛
慝
慟
慡
慢
慣
慤
慥
慧
慨
慰
慵
慶
慷
慾
憁
憂
憋
憍
憎
憐
憑
憔
憝
憞
憟
憤
憦
憧
憨
憩
憫
憬
憶
憷
憽
憾
懁
懂
懈
應
懊
懋
懐
懑
懒
懓
懔
懗
懦
懭
懵
懷
懺
懽
懿
戀
戂
戃
戆
戈
戊
戋
戌
戍
戎
戏
成
我
戒
戕
或
戗
战
戚
戛
戝
戞
戟
戢
戣
戤
戥
戦
截
戬
戮
戯
戰
戲
戳
戴
戵
戶
户
戸
戽
戾
房
所
扁
扃
扆
扇
扈
扉
扊
手
扌
才
扎
扑
扒
打
扔
払
托
扛
扞
扣
扦
执
扩
扪
扫
扬
扭
扮
扯
扰
扳
扶
批
扼
找
承
技
抂
抄
抉
把
抑
抒
抓
抔
投
抖
抗
折
抚
抛
抜
択
抟
抠
抡
抢
抣
护
报
抧
抨
披
抬
抱
抵
抹
抺
抻
押
抽
抿
拂
拄
担
拆
拇
拈
拉
拊
拌
拍
拎
拐
拒
拓
拔
拖
拗
拘
拙
拚
招
拜
拝
拟
拡
拢
拣
拥
拦
拧
拨
择
括
拭
拮
拯
拰
拱
拳
拴
拵
拶
拷
拼
拽
拾
拿
持
挂
指
挈
按
挍
挎
挑
挖
挘
挚
挛
挝
挞
挟
挠
挡
挢
挣
挤
挥
挨
挪
挫
挮
振
挱
挲
挵
挷
挹
挺
挼
挽
捂
捃
捅
捆
捉
捋
捌
捍
捎
捏
捐
捕
捜
捞
损
捡
换
捣
捧
捨
捩
捪
捭
据
捯
捱
捴
捶
捷
捺
捻
掀
掂
掆
掇
授
掉
掊
掌
掍
掎
掏
掐
排
掖
掘
掚
掛
掟
掠
採
探
掣
掤
接
控
推
掩
措
掬
掮
掰
掲
掳
掴
掷
掸
掺
掼
掾
揀
揂
揄
揆
揉
揌
揍
揎
描
提
揑
插
揖
揚
換
揝
揟
揠
握
揣
揤
揦
揩
揪
揫
揭
揯
揰
援
揶
揸
揼
揽
揾
揿
搀
搁
搂
搅
搉
搋
搏
搐
搓
搔
搖
搘
搜
搞
搠
搡
搢
搣
搥
搦
搧
搪
搬
搭
搳
搴
搵
携
搻
搽
搾
摀
摁
摄
摆
摇
摈
摊
摋
摐
摒
摔
摖
摘
摞
摠
摧
摩
摭
摰
摵
摸
摹
摺
摽
撂
撃
撄
撅
撆
撇
撉
撊
撋
撐
撑
撒
撕
撚
撜
撝
撞
撤
撥
撩
撫
撬
播
撮
撰
撱
撲
撵
撷
撸
撹
撺
撼
擀
擁
擂
擅
擇
操
擎
擏
擐
擑
擒
擓
擔
擕
擗
擘
據
擞
擢
擤
擦
擮
擱
擲
擹
擺
擿
攀
攃
攊
攎
攒
攘
攥
攫
攮
支
攴
攵
收
攸
改
攺
攻
放
政
故
效
敌
敍
敎
敏
救
敕
敖
敗
敘
教
敛
敝
敞
敢
散
敦
敧
敫
敬
敯
数
敲
整
敵
敷
數
敻
敿
斂
文
斉
斋
斌
斎
斐
斑
斓
斗
料
斛
斜
斞
斟
斡
斤
斥
斧
斨
斩
斫
斬
断
斯
新
斳
斷
方
斺
於
施
斾
斿
旁
旃
旄
旅
旆
旈
旉
旋
旌
旎
族
旒
旔
旖
旗
旛
无
旡
既
日
旦
旧
旨
早
旫
旬
旭
旮
旯
旰
旱
旳
时
旷
旸
旺
旻
旼
昀
昁
昂
昃
昆
昇
昉
昊
昌
明
昏
易
昔
昕
昙
昜
昝
星
映
昡
春
昧
昨
昩
昬
昭
昮
是
昱
昳
昴
昵
昶
昸
昼
昽
显
晁
時
晃
晆
晇
晋
晌
晏
晒
晓
晔
晕
晖
晗
晚
晛
晞
晟
晠
晤
晦
晧
晨
晩
晪
晬
普
景
晰
晱
晳
晴
晶
晷
晸
晹
智
晻
晼
晾
暁
暂
暄
暅
暇
暈
暌
暐
暑
暔
暖
暗
暘
暙
暚
暝
暠
暦
暧
暨
暪
暮
暴
暹
暻
暾
曇
曈
曉
曌
曖
曙
曚
曛
曜
曝
曤
曦
曩
曰
曱
曲
曳
更
曷
書
曹
曺
曼
曽
曾
替
最
會
月
有
朊
朋
朌
服
朐
朑
朓
朔
朕
朗
望
朝
朞
期
朣
朦
朧
木
未
末
本
札
术
朰
朱
朲
朴
朵
朷
机
朽
杀
杂
权
杆
杈
杉
杊
李
杏
材
村
杓
杖
杘
杜
杞
束
杠
条
来
杨
杩
杪
杬
杭
杯
杰
東
杲
杳
杵
杷
杸
杺
杼
杽
松
板
极
构
枇
枈
枉
枊
枋
析
枕
林
枘
枚
果
枝
枞
枢
枣
枥
枧
枨
枪
枫
枬
枭
枯
枰
枱
枳
枵
架
枷
枸
枺
枻
柁
柃
柄
柇
柍
柏
某
柑
柒
染
柔
柘
柚
柜
柞
柟
柠
柢
查
柩
柬
柯
柰
柱
柳
柴
柸
査
柾
柿
栀
栃
栄
栅
栆
标
栈
栉
栊
栋
栌
栍
栎
栏
栐
树
栒
栓
栖
栗
栝
栞
栟
校
栢
栣
栩
株
栭
栱
栲
栳
样
核
根
栻
格
栽
栾
桀
桁
桂
桃
桄
桅
框
案
桉
桌
桍
桎
桏
桐
桑
桓
桔
桕
桖
桗
桘
桛
桜
桟
桠
桡
桢
档
桤
桥
桦
桧
桨
桩
桫
桭
桯
桲
桴
桶
桷
梁
梃
梅
梆
梋
梏
梓
梗
條
梢
梦
梧
梨
梬
梭
梯
械
梳
梵
梶
梼
梽
梿
检
棂
棄
棅
棉
棋
棌
棍
棒
棕
棘
棚
棛
棜
棠
棡
棣
棭
森
棰
棱
棲
棴
棵
棷
棹
棺
棻
棾
棿
椀
椁
椃
椅
椆
椇
椋
植
椎
椐
椒
椗
椚
検
椟
椠
椤
椥
椪
椭
椰
椴
椶
椷
椸
椹
椽
椿
楁
楂
楄
楓
楔
楕
楚
楝
楞
楠
楢
楣
楦
楩
楫
業
楮
楯
極
楷
楸
楹
楼
楽
榀
概
榄
榆
榇
榈
榉
榍
榎
榔
榕
榖
榘
榚
榛
榜
榟
榣
榤
榦
榧
榨
榫
榭
榮
榱
榴
榷
榺
榻
榼
榾
槁
槃
槊
構
槌
槍
槎
槏
槐
槑
様
槚
槛
槟
槠
槢
槤
槦
槪
槭
槯
槽
槿
樂
樈
樉
樊
樋
樍
樓
樖
樗
標
樟
模
樣
樤
樥
樨
権
横
樫
樯
樰
樱
樴
樵
樹
樽
樾
橄
橇
橋
橍
橐
橖
橘
橙
橚
橛
機
橡
橥
橦
橯
橰
橱
橹
橼
橾
檀
檄
檎
檐
檗
檘
檜
檞
檥
檧
檩
檫
檬
檭
檮
檳
檸
櫁
櫄
櫆
櫈
櫖
櫙
櫠
櫢
櫩
櫵
櫻
欀
欄
欈
欉
權
欎
欒
欕
欛
欝
欠
次
欢
欣
欤
欧
欪
欲
欳
欵
欸
欹
欺
款
歀
歃
歆
歇
歈
歉
歌
歎
歐
歓
歘
歙
歞
歡
止
正
此
步
武
歧
歩
歪
歯
歲
歳
歵
歸
歹
死
歼
殁
殂
殃
殄
殆
殇
殉
殊
残
殍
殒
殓
殖
殘
殚
殛
殜
殡
殢
殥
殦
殩
殲
殳
殴
段
殷
殹
殺
殻
殼
殽
殿
毀
毁
毂
毅
毋
母
毎
每
毒
毓
比
毕
毖
毗
毘
毙
毛
毝
毡
毫
毯
毳
毼
毽
氅
氆
氇
氈
氋
氍
氏
氐
民
氓
气
氖
気
氙
氚
氛
氜
氟
氡
氢
氣
氤
氦
氧
氨
氩
氪
氮
氯
氰
氲
水
氵
氷
永
氹
氺
氽
汀
汁
求
汅
汆
汇
汉
汊
汋
汐
汔
汕
汖
汗
汘
汚
汛
汜
汝
汞
江
池
污
汤
汦
汨
汩
汪
汫
汬
汭
汯
汰
汲
汳
汴
汶
汷
汸
汹
決
汽
汾
沁
沂
沃
沄
沅
沆
沈
沉
沌
沏
沐
沒
沓
沔
沕
沖
沗
沙
沚
沛
沜
沟
没
沢
沣
沤
沥
沦
沧
沩
沪
沫
沬
沭
沮
沱
河
沵
沷
沸
油
沺
治
沼
沽
沾
沿
況
泄
泅
泈
泉
泊
泌
泒
泓
泔
法
泖
泗
泚
泛
泞
泠
泡
波
泣
泥
注
泪
泫
泬
泮
泯
泰
泱
泳
泵
泶
泷
泸
泺
泻
泼
泽
泾
洁
洃
洄
洇
洋
洌
洎
洐
洒
洓
洗
洙
洛
洞
洣
津
洨
洩
洪
洫
洮
洱
洲
洳
洵
洷
洹
洺
活
洼
洽
派
流
浂
浃
浄
浅
浆
浇
浈
浉
浊
测
浌
济
浏
浐
浑
浒
浓
浔
浗
浙
浚
浛
浜
浞
浟
浠
浡
浣
浥
浦
浩
浪
浮
浯
浲
浴
浵
海
浸
浼
涁
涂
涅
消
涉
涌
涍
涎
涑
涓
涔
涕
涙
涛
涜
涝
涞
涟
涠
涡
涣
涤
润
涧
涨
涩
涪
涫
涮
涯
涱
液
涴
涵
涸
涼
涿
淀
淄
淅
淆
淇
淉
淋
淌
淏
淑
淒
淖
淘
淙
淚
淝
淞
淟
淠
淡
淢
淣
淤
淦
淨
淩
淫
淬
淮
淯
深
淳
淵
混
淸
淹
淺
添
淼
淿
清
渇
渉
渊
渌
渍
渎
渐
渑
渓
渔
渕
渖
渗
渚
減
渜
渝
渠
渡
渢
渣
渤
渥
渦
温
測
渭
港
渲
渴
渶
渷
游
渺
渼
湃
湄
湈
湉
湋
湍
湎
湓
湔
湖
湘
湛
湜
湟
湧
湫
湮
湱
湲
湳
湴
湵
湾
湿
満
溁
溃
溅
溆
溉
溍
溏
源
準
溘
溛
溜
溟
溢
溥
溧
溨
溪
溫
溭
溯
溰
溱
溲
溴
溶
溷
溺
溽
溾
滀
滁
滂
滄
滅
滇
滈
滋
滏
滐
滑
滓
滔
滕
滗
滘
滙
滚
滝
滞
滟
滠
满
滢
滤
滥
滦
滨
滩
滫
滴
滹
滼
滾
滿
漁
漂
漃
漆
漈
漉
漌
漏
漐
漓
演
漕
漖
漗
漞
漠
漢
漣
漥
漩
漪
漫
漭
漯
漱
漳
漷
漾
漿
潆
潇
潉
潋
潍
潎
潏
潑
潔
潗
潘
潜
潞
潟
潢
潤
潦
潧
潫
潭
潮
潲
潴
潸
潺
潼
澁
澄
澈
澋
澌
澍
澎
澏
澐
澒
澔
澕
澖
澘
澚
澜
澡
澤
澥
澧
澪
澳
澴
澶
澹
澽
澿
激
濁
濂
濃
濅
濉
濊
濎
濑
濒
濔
濕
濘
濛
濜
濞
濠
濡
濤
濩
濮
濯
濲
濳
濶
濷
瀌
瀑
瀒
瀗
瀘
瀚
瀛
瀜
瀡
瀢
瀣
瀥
瀬
瀴
瀾
灂
灌
灏
灑
灜
灞
灡
灣
火
灭
灯
灰
灴
灵
灶
灸
灹
灼
災
灾
灿
炀
炅
炆
炇
炉
炊
炋
炌
炎
炒
炓
炔
炕
炖
炘
炙
炜
炝
炣
炤
炪
炫
炬
炭
炮
炯
炱
炳
炷
炸
点
為
炻
炼
炽
炿
烀
烁
烂
烃
烅
烈
烊
烏
烔
烕
烘
烙
烛
烜
烝
烟
烡
烤
烦
烧
烨
烩
烫
烬
热
烯
烲
烷
烹
烺
烼
烽
焂
焉
焊
焎
焐
焓
焔
焕
焖
焗
焘
焙
焚
焜
無
焥
焦
焩
焬
焮
焯
焰
焱
然
焹
焼
焿
煁
煂
煅
煉
煊
煌
煎
煕
煙
煚
煜
煞
煤
煦
照
煨
煩
煮
煯
煲
煳
煸
煽
熀
熃
熄
熉
熊
熋
熍
熏
熑
熔
熖
熘
熙
熜
熟
熠
熣
熥
熨
熬
熮
熱
熵
熹
熻
熽
熾
熿
燀
燂
燃
燄
燈
燊
燌
燍
燎
燐
燒
燔
燕
燚
燞
營
燠
燥
燦
燧
燫
燭
燮
燹
燻
燿
爆
爉
爑
爙
爚
爛
爝
爠
爤
爦
爨
爪
爫
爬
爭
爮
爰
爱
爲
爴
爵
父
爷
爸
爹
爻
爽
爾
爿
牆
片
版
牋
牌
牍
牒
牖
牗
牙
牛
牞
牟
牠
牡
牢
牦
牧
物
牭
牯
牲
牵
牷
特
牺
牾
犀
犁
犂
犄
犅
犆
犇
犈
犊
犍
犏
犒
犓
犞
犟
犠
犥
犨
犩
犫
犬
犯
状
犷
犸
犹
犻
犽
犿
狁
狂
狄
狆
狈
狍
狎
狐
狒
狓
狗
狘
狙
狝
狞
狠
狡
狣
狧
狩
独
狭
狮
狰
狱
狲
狷
狸
狺
狻
狼
狽
猁
猂
猃
猅
猇
猈
猊
猎
猓
猕
猖
猗
猛
猜
猝
猞
猟
猡
猢
猥
猩
猪
猫
猬
献
猱
猲
猴
猶
猷
猹
猾
猿
獂
獃
獄
獅
獍
獐
獒
獗
獜
獠
獣
獤
獦
獨
獬
獭
獯
獲
獸
獹
獾
獿
玄
率
玉
王
玌
玎
玑
玒
玔
玖
玘
玙
玛
玟
玠
玢
玥
玦
玩
玪
玫
玮
环
现
玲
玳
玷
玹
玺
玻
玽
珀
珂
珅
珇
珈
珉
珊
珍
珎
珏
珐
珑
珓
珖
珗
珙
珞
珠
珣
珥
珧
珨
珩
珪
班
珮
珰
珲
珶
珷
珺
珽
現
球
琄
琅
理
琇
琉
琊
琍
琎
琏
琐
琒
琓
琖
琚
琛
琢
琤
琥
琦
琧
琨
琪
琬
琭
琮
琰
琲
琳
琴
琵
琶
琸
琻
琼
琾
瑀
瑁
瑄
瑅
瑕
瑖
瑗
瑘
瑙
瑚
瑛
瑜
瑞
瑟
瑠
瑢
瑤
瑥
瑧
瑪
瑭
瑰
瑴
瑶
瑷
瑸
瑾
璀
璁
璃
璆
璇
璈
璊
璋
璌
璎
璏
璐
璓
璘
璚
璜
璝
璞
璟
璠
璥
璧
璨
璩
璪
璬
璯
環
瓄
瓅
瓈
瓊
瓑
瓒
瓗
瓙
瓜
瓝
瓞
瓠
瓡
瓢
瓣
瓤
瓦
瓭
瓮
瓯
瓰
瓲
瓴
瓶
瓷
瓹
瓿
甀
甁
甃
甄
甍
甏
甑
甘
甙
甚
甜
生
産
甥
甦
用
甩
甪
甫
甬
甭
甯
田
由
甲
申
甴
电
男
甸
町
画
甼
甾
畀
畄
畅
畈
畊
畋
界
畍
畏
畑
畓
畔
畗
畘
留
畚
畜
畠
畡
畤
略
畦
畧
畨
畩
番
畫
畮
畯
異
畲
畳
畴
畵
當
畸
畹
畺
畼
畾
畿
疀
疃
疅
疆
疈
疊
疋
疍
疏
疑
疒
疔
疕
疖
疗
疙
疚
疛
疜
疝
疟
疠
疡
疢
疣
疤
疥
疧
疩
疫
疭
疮
疯
疰
疱
疲
疳
疴
疵
疸
疹
疼
疽
疾
痂
痃
痄
病
症
痈
痉
痊
痍
痒
痔
痕
痖
痘
痛
痞
痢
痣
痤
痧
痨
痪
痫
痬
痭
痰
痱
痲
痴
痵
痷
痹
痻
痼
痾
痿
瘀
瘁
瘄
瘅
瘆
瘇
瘊
瘋
瘌
瘔
瘕
瘖
瘗
瘘
瘙
瘝
瘟
瘠
瘢
瘤
瘦
瘩
瘪
瘫
瘮
瘯
瘴
瘸
瘹
瘾
瘿
癀
療
癃
癋
癌
癒
癔
癖
癜
癝
癞
癠
癡
癣
癧
癪
癫
癯
癸
発
登
發
白
百
皂
的
皆
皇
皈
皋
皌
皎
皏
皐
皑
皓
皖
皙
皛
皤
皧
皮
皱
皲
皴
皶
皿
盂
盃
盅
盆
盈
盉
益
盍
盎
盏
盐
监
盒
盓
盔
盖
盗
盘
盛
盜
盞
盟
盠
盡
監
盤
盥
盦
盧
盪
盫
盬
目
盯
盰
盱
盲
直
盵
相
盹
盺
盻
盼
盾
眀
省
眂
眈
眉
眊
看
眕
眖
眘
眙
眚
眞
真
眠
眣
眤
眦
眨
眩
眬
眭
眯
眶
眷
眸
眺
眻
眼
着
睁
睃
睇
睍
睎
睏
睐
睑
睒
睕
睚
睛
睡
睢
督
睥
睦
睨
睩
睫
睬
睭
睯
睱
睲
睶
睸
睹
睽
睾
睿
瞀
瞃
瞄
瞅
瞋
瞌
瞍
瞎
瞑
瞒
瞓
瞟
瞠
瞥
瞧
瞩
瞪
瞬
瞭
瞰
瞳
瞵
瞶
瞷
瞻
瞽
瞿
矅
矉
矍
矗
矛
矜
矢
矣
知
矦
矨
矩
矫
矬
短
矮
矰
矱
石
矶
矸
矽
矾
矿
砀
码
砂
砃
砉
砊
砋
砌
砍
砏
砑
砒
研
砕
砖
砗
砘
砚
砜
砝
砞
砟
砣
砥
砦
砧
砩
砬
砭
砯
砰
砲
破
砵
砶
砷
砸
砹
砺
砻
砼
砾
础
硅
硇
硉
硌
硍
硎
硐
硑
硒
硓
硕
硖
硗
硙
硚
硝
硟
硠
硣
硪
硫
硬
硭
确
硯
硵
硷
硻
硼
碁
碇
碉
碌
碍
碎
碑
碓
碕
碗
碘
碚
碛
碜
碟
碡
碣
碦
碧
碫
碰
碱
碲
碳
碴
碶
碹
確
碼
碾
磀
磁
磂
磅
磊
磋
磐
磔
磕
磗
磙
磞
磡
磨
磩
磬
磲
磴
磶
磷
磹
磺
磻
礁
礅
礆
礈
礉
礐
礑
礡
礩
礭
礰
礴
礶
示
礻
礼
礽
社
祀
祁
祂
祆
祇
祈
祉
祊
祍
祎
祐
祓
祖
祗
祘
祙
祚
祛
祜
祝
神
祟
祠
祢
祥
祦
票
祪
祭
祯
祷
祸
祺
祻
祼
禀
禁
禄
禅
禇
禈
禊
禍
福
禒
禚
禝
禠
禢
禤
禥
禧
禪
禮
禱
禳
禷
禹
禺
离
禽
禾
秀
私
秃
秄
秆
秉
秋
种
科
秒
秕
秘
秞
租
秡
秣
秤
秦
秧
秩
秫
秭
积
称
秲
秴
秸
移
秽
秾
稀
稁
稂
程
稌
稍
税
稑
稓
稔
稗
稚
稜
稞
稠
稡
稣
稥
種
稯
稲
稳
稵
稷
稹
稻
稼
稽
稿
穀
穂
穅
穆
穊
穌
積
穏
穑
穗
穙
穟
穠
穢
穣
穨
穩
穭
穰
穱
穲
穴
究
穷
穸
穹
空
穽
穿
窀
突
窂
窃
窄
窅
窆
窈
窋
窍
窑
窒
窓
窔
窕
窖
窗
窘
窜
窝
窟
窠
窣
窤
窥
窦
窨
窩
窪
窫
窬
窭
窮
窰
窳
窴
窽
窿
竂
竉
竊
立
竑
竕
竖
站
竚
竜
竞
竟
章
竣
童
竦
竧
竬
竭
端
競
竹
竺
竽
竾
竿
笁
笃
笄
笆
笇
笈
笊
笋
笏
笐
笑
笔
笕
笖
笙
笛
笜
笞
笟
笠
笣
笤
笥
符
笨
笪
笫
第
笭
笮
笯
笱
笳
笴
笵
笸
笹
笺
笻
笼
笾
筆
筇
筈
等
筊
筋
筎
筏
筐
筑
筒
答
策
筗
筚
筛
筜
筝
筠
筢
筣
筨
筮
筯
筱
筲
筵
筷
筹
筼
筽
签
简
箂
箅
箆
箍
箐
箓
箔
箕
算
箛
箜
箝
箟
管
箥
箦
箧
箩
箪
箫
箬
箭
箮
箯
箱
箴
箵
箸
節
篁
範
篆
篇
築
篌
篍
篑
篓
篙
篛
篝
篠
篡
篥
篦
篪
篬
篮
篱
篷
篼
篾
簁
簃
簇
簉
簋
簌
簏
簓
簕
簙
簟
簡
簧
簪
簫
簱
簲
簸
簾
簿
籁
籃
籇
籉
籍
籎
籑
籒
籙
籞
籠
籢
籣
米
籴
类
籼
籽
粃
粄
粅
粉
粋
粍
粐
粑
粒
粕
粗
粘
粛
粜
粝
粞
粟
粢
粤
粥
粦
粧
粪
粮
粰
粱
粲
粳
粶
粹
粼
粽
精
粿
糁
糅
糊
糌
糍
糐
糕
糖
糗
糙
糜
糟
糠
糨
糬
糯
糱
糸
糹
系
糼
紀
紁
紃
約
紅
紊
紋
納
紐
紑
純
紗
紙
級
素
索
紣
紧
紫
紮
累
細
紴
紵
紸
絁
終
組
絆
絉
絊
経
結
絕
絖
絙
絜
絡
絥
給
絨
絩
絬
絮
統
絲
絵
絶
絷
綉
經
継
続
綜
綟
綠
綥
綦
綧
綫
維
綮
綺
綿
緀
緆
緊
緋
緌
総
緐
緑
緒
緓
緕
緖
線
緣
編
緩
緪
練
緻
緼
緾
縁
縄
縈
縍
縏
縒
縕
縢
縤
縦
縫
縷
縺
縻
總
繁
繄
繇
繋
繌
繐
織
繘
繙
繚
繡
繧
繩
繬
繼
纁
纂
纆
纇
續
纑
纔
纕
纙
纛
纟
纠
纡
红
纣
纤
纥
约
级
纨
纩
纪
纫
纬
纭
纮
纯
纰
纱
纲
纳
纵
纶
纷
纸
纹
纺
纽
纾
线
绀
绂
练
组
绅
细
织
终
绉
绊
绋
绌
绍
绎
经
绐
绑
绒
结
绔
绕
绖
绗
绘
给
绚
绛
络
绝
绞
统
绡
绢
绣
绥
绦
继
绨
绩
绪
绫
续
绮
绯
绰
绱
绲
绳
维
绵
绶
绷
绸
绺
绻
综
绽
绾
绿
缀
缁
缂
缃
缄
缅
缆
缇
缈
缉
缌
缍
缎
缏
缐
缑
缒
缓
缔
缕
编
缗
缘
缙
缚
缛
缜
缝
缟
缠
缡
缢
缣
缤
缥
缦
缨
缩
缪
缫
缬
缭
缮
缯
缰
缱
缴
缵
缶
缸
缹
缺
缿
罂
罄
罅
罏
罐
网
罔
罕
罗
罘
罚
罞
罟
罠
罡
罢
罣
罥
罨
罩
罪
置
罰
罱
署
罴
罹
罾
羁
羄
羅
羇
羈
羉
羊
羌
美
羏
羑
羒
羔
羕
羙
羚
羜
羝
羞
羟
羡
羢
羣
群
羦
羧
義
羮
羯
羰
羲
羴
羸
羹
羼
羽
羿
翀
翁
翃
翄
翅
翊
翌
翎
翑
習
翓
翔
翕
翖
翘
翚
翝
翟
翠
翡
翥
翦
翩
翯
翰
翱
翳
翴
翺
翻
翼
耀
老
考
耄
者
耆
耇
耋
而
耍
耐
耒
耕
耗
耘
耙
耜
耥
耦
耧
耨
耩
耪
耳
耵
耶
耷
耸
耹
耻
耽
耿
聂
聃
聅
聆
聊
聋
职
聍
聐
聒
联
聖
聘
聚
聞
聠
聡
聩
聪
聫
聬
聲
職
聼
聽
聿
肃
肄
肆
肇
肉
肋
肌
肎
肐
肑
肒
肓
肕
肖
肘
肚
肛
肜
肝
肟
肠
股
肢
肤
肥
肦
肩
肪
肫
肮
肯
肱
育
肴
肷
肺
肼
肽
肾
肿
胀
胁
胂
胃
胄
胆
胇
背
胍
胎
胐
胖
胗
胘
胚
胛
胜
胝
胞
胡
胤
胥
胧
胨
胩
胪
胫
胬
胭
胯
胰
胱
胲
胳
胴
胶
胸
胹
胺
胼
能
脂
脅
脆
脇
脈
脉
脊
脍
脏
脐
脑
脓
脔
脖
脘
脙
脚
脞
脢
脤
脯
脱
脲
脳
脷
脸
脾
腄
腆
腈
腉
腊
腋
腌
腍
腐
腑
腓
腔
腕
腖
腙
腚
腞
腠
腥
腦
腧
腩
腭
腮
腰
腱
腴
腵
腶
腹
腺
腻
腼
腾
腿
膀
膇
膈
膊
膋
膏
膑
膒
膘
膛
膜
膝
膞
膟
膠
膥
膦
膨
膭
膰
膳
膴
膷
膺
膻
膽
臀
臁
臂
臃
臆
臉
臊
臐
臕
臙
臝
臡
臣
臥
臦
臧
臨
自
臬
臭
臰
臱
至
致
臺
臻
臼
臾
舀
舂
舅
舆
與
興
舊
舌
舍
舎
舐
舒
舔
舖
舗
舘
舛
舜
舞
舟
舡
舢
舣
舤
舨
航
舫
般
舭
舮
舯
舰
舱
舳
舵
舶
舷
舸
船
舺
舻
舾
艂
艃
艄
艅
艇
艉
艋
艎
艏
艐
艔
艘
艛
艜
艞
艟
艠
艦
艨
艩
艮
良
艰
艱
色
艳
艶
艷
艹
艺
艽
艾
艿
节
芃
芄
芅
芇
芈
芉
芊
芋
芌
芍
芎
芏
芑
芒
芔
芗
芘
芙
芜
芝
芟
芡
芤
芥
芦
芧
芨
芩
芪
芫
芬
芭
芮
芯
芰
花
芳
芴
芶
芷
芸
芹
芻
芽
芾
芿
苁
苄
苅
苆
苇
苈
苊
苋
苌
苍
苎
苏
苑
苒
苓
苔
苕
苖
苗
苙
苛
苜
苝
苞
苟
苡
苢
苣
苤
若
苦
苫
苯
英
苴
苶
苷
苹
苺
苻
苼
苾
苿
茀
茁
茂
范
茄
茅
茆
茉
茋
茌
茎
茏
茔
茕
茖
茗
茛
茜
茤
茧
茨
茪
茫
茬
茭
茯
茱
茲
茴
茵
茶
茸
茹
茺
茼
荀
荂
荃
荄
荅
荆
荇
草
荊
荎
荏
荐
荑
荒
荔
荖
荗
荘
荙
荚
荛
荜
荞
荟
荠
荡
荣
荤
荥
荦
荧
荨
荩
荪
荫
荭
药
荳
荷
荸
荹
荻
荼
荽
莅
莆
莉
莋
莎
莑
莒
莓
莘
莛
莜
莞
莠
莦
莨
莩
莪
莫
莰
莱
莲
莳
莴
获
莸
莹
莺
莼
莽
菀
菁
菂
菅
菇
菈
菊
菌
菎
菏
菑
菓
菔
菖
菘
菜
菞
菟
菠
菡
菣
菩
菪
菫
華
菰
菱
菲
菸
菹
菽
菾
萁
萃
萄
萆
萋
萌
萍
萎
萏
萑
萘
萚
萝
萞
萣
萤
营
萦
萧
萨
萫
萬
萱
萸
萼
落
萾
葆
葉
葎
葑
著
葙
葚
葛
葜
葝
葡
董
葦
葩
葫
葬
葭
葱
葳
葵
葶
葺
蒁
蒂
蒃
蒉
蒋
蒌
蒍
蒎
蒐
蒕
蒗
蒙
蒜
蒟
蒡
蒨
蒪
蒯
蒲
蒷
蒸
蒹
蒺
蒻
蒼
蒽
蒿
蓁
蓄
蓉
蓊
蓍
蓑
蓓
蓖
蓘
蓛
蓝
蓟
蓠
蓥
蓦
蓬
蓮
蓼
蓿
蔃
蔈
蔉
蔌
蔑
蔒
蔓
蔗
蔚
蔟
蔡
蔫
蔬
蔲
蔵
蔷
蔸
蔹
蔺
蔻
蔼
蔽
蔾
蕀
蕃
蕄
蕅
蕈
蕉
蕊
蕋
蕑
蕖
蕙
蕞
蕟
蕤
蕨
蕩
蕲
蕴
蕹
蕺
蕻
蕾
薄
薅
薇
薊
薍
薏
薔
薕
薙
薚
薛
薜
薤
薥
薩
薪
薫
薬
薭
薮
薯
薰
薹
薼
藀
藁
藉
藍
藏
藐
藒
藓
藕
藖
藜
藝
藤
藨
藩
藮
藳
藴
藻
藿
蘅
蘇
蘑
蘖
蘗
蘜
蘥
蘧
蘩
蘭
蘶
蘸
蘹
蘼
蘿
虊
虎
虏
虐
虑
虒
虔
處
虘
虚
虛
虞
號
虢
虩
虫
虬
虮
虱
虹
虺
虻
虼
虽
虾
虿
蚀
蚁
蚂
蚇
蚈
蚊
蚋
蚌
蚍
蚎
蚓
蚕
蚙
蚜
蚝
蚞
蚡
蚢
蚣
蚤
蚧
蚨
蚩
蚪
蚬
蚯
蚰
蚱
蚴
蚵
蚶
蚸
蚺
蚻
蛀
蛁
蛃
蛄
蛆
蛇
蛉
蛊
蛋
蛍
蛎
蛏
蛐
蛑
蛔
蛗
蛘
蛙
蛚
蛛
蛞
蛟
蛤
蛥
蛩
蛪
蛭
蛮
蛰
蛱
蛲
蛳
蛴
蛷
蛹
蛾
蜀
蜂
蜃
蜅
蜇
蜈
蜉
蜊
蜍
蜏
蜑
蜒
蜓
蜕
蜗
蜘
蜚
蜜
蜞
蜡
蜢
蜥
蜧
蜩
蜪
蜭
蜮
蜱
蜴
蜷
蜻
蜿
蝀
蝇
蝈
蝉
蝊
蝋
蝌
蝎
蝒
蝕
蝗
蝙
蝟
蝠
蝡
蝣
蝥
蝮
蝰
蝱
蝴
蝵
蝶
蝸
蝺
蝼
蝾
螂
螃
螅
螈
螉
融
螛
螟
螢
螣
螨
螫
螭
螯
螱
螳
螺
螽
蟀
蟂
蟆
蟊
蟋
蟑
蟒
蟔
蟗
蟙
蟚
蟛
蟝
蟠
蟢
蟥
蟦
蟧
蟨
蟪
蟬
蟭
蟮
蟲
蟳
蟴
蟹
蟾
蠃
蠊
蠍
蠎
蠒
蠓
蠕
蠖
蠗
蠛
蠝
蠞
蠠
蠡
蠢
蠧
蠲
蠳
蠹
蠼
血
衃
衄
衅
衆
衇
行
衍
衏
術
衔
街
衙
衛
衜
衝
衞
衡
衢
衣
补
衧
表
衩
衫
衬
衮
衰
衱
衲
衷
衸
衹
衽
衾
衿
袁
袂
袄
袅
袆
袈
袋
袍
袒
袓
袔
袖
袘
袜
袡
袢
袤
袪
被
袭
袮
袱
袴
袷
袸
袻
袼
裁
裂
裃
装
裆
裉
裌
裎
裏
裓
裔
裕
裘
裙
補
裝
裞
裟
裡
裢
裣
裤
裥
裦
裨
裰
裱
裳
裴
裵
裷
裸
裹
裼
裾
褀
褁
褂
複
褊
褋
褎
褏
褐
褒
褓
褔
褙
褚
褛
褝
褠
褡
褥
褪
褫
褮
褰
褱
褴
褵
褶
褷
襁
襄
襋
襌
襘
襙
襞
襟
襦
襬
襲
襵
襺
襾
西
要
覃
覅
覆
覇
見
規
覑
覓
覕
視
覚
覜
覧
親
覫
覲
観
覵
觀
见
观
规
觅
视
觇
览
觉
觊
觍
觎
觐
觑
角
觚
觜
觞
觟
解
觤
觥
触
觭
觯
觳
觵
觻
言
訇
計
訓
記
訝
訣
訤
訨
訪
設
許
訳
訴
訶
訸
註
証
訾
詈
評
詠
詤
試
詩
詰
話
該
詹
誀
誅
誇
誉
誊
誋
誌
認
誓
誕
誘
語
誟
誠
誤
說
誫
説
読
誰
課
誳
誽
調
諀
諁
談
請
諒
論
諘
諟
諡
諧
諯
諴
諵
諷
諸
諾
謀
謂
謇
謊
謋
謌
謎
謏
謙
講
謝
謠
謡
謦
謲
謳
謶
譌
譑
譒
識
譚
譞
譤
警
譩
譬
譭
譮
議
譱
護
譸
譺
譼
讀
讁
讃
變
讐
讓
讚
计
订
讣
认
讥
讦
讧
讨
让
讪
讫
训
议
讯
记
讲
讳
讴
讵
讶
讷
许
讹
论
讼
讽
设
访
诀
证
诂
诃
评
诅
识
诈
诉
诊
诋
诌
词
诎
诏
译
诒
诓
诔
试
诖
诗
诘
诙
诚
诛
诜
话
诞
诟
诠
诡
询
诣
诤
该
详
诧
诨
诩
诫
诬
语
诮
误
诰
诱
诲
诳
说
诵
诶
请
诸
诹
诺
读
诼
诽
课
诿
谀
谁
谂
调
谄
谅
谆
谇
谈
谊
谋
谌
谍
谎
谏
谐
谑
谒
谓
谔
谕
谖
谗
谘
谙
谚
谛
谜
谝
谟
谠
谡
谢
谣
谤
谥
谦
谧
谨
谩
谪
谬
谭
谯
谰
谱
谲
谳
谴
谵
谶
谷
豁
豃
豅
豆
豇
豉
豊
豋
豌
豐
豔
豕
豗
豚
豞
象
豢
豪
豫
豮
豯
豳
豸
豹
豺
貂
貅
貉
貊
貌
貓
貔
貗
貘
貙
貝
貞
貟
負
貨
販
貪
貫
貮
貳
貴
費
賀
賈
賊
賋
賍
賓
賙
賛
賜
賞
賣
賤
賥
賨
質
賭
賮
賱
賴
賸
賽
賿
贀
贃
贄
贇
贈
贏
贕
贖
贝
贞
负
贠
贡
财
责
贤
败
账
货
质
贩
贪
贫
贬
购
贮
贯
贰
贱
贲
贳
贴
贵
贶
贷
贸
费
贺
贻
贼
贽
贾
贿
赀
赁
赂
赃
资
赅
赇
赈
赉
赊
赋
赌
赍
赎
赏
赐
赒
赓
赔
赕
赖
赘
赙
赚
赛
赜
赝
赞
赟
赠
赡
赢
赣
赤
赦
赧
赫
赭
赮
走
赳
赴
赵
赶
起
赺
赽
赿
趁
趂
趄
超
越
趋
趓
趔
趙
趚
趟
趣
趫
趮
足
趴
趵
趷
趸
趺
趾
趿
跂
跃
跄
跅
跆
跈
跋
跌
跎
跏
跑
跔
跖
跗
跚
跛
距
跞
跟
跠
跡
跣
跤
跥
跨
跩
跪
跫
跬
路
跲
跳
践
跶
跷
跸
跹
跺
跻
跽
跿
踁
踂
踅
踆
踇
踉
踊
踌
踍
踎
踏
踑
踔
踘
踜
踝
踞
踟
踠
踢
踣
踥
踦
踨
踩
踪
踭
踮
踯
踰
踱
踵
踷
踹
踺
踼
踽
蹁
蹂
蹄
蹇
蹈
蹉
蹊
蹋
蹑
蹒
蹓
蹗
蹘
蹙
蹚
蹟
蹤
蹦
蹩
蹪
蹬
蹭
蹮
蹰
蹱
蹲
蹴
蹶
蹹
蹼
蹿
躁
躂
躅
躇
躍
躏
躜
躤
躧
身
躬
躯
躱
躲
躺
車
軋
軌
軍
軐
軑
軟
転
軤
軰
軱
軽
輀
輁
載
輋
輏
輐
輑
輓
輔
輕
輝
輩
輪
輬
輮
輷
輸
轈
轉
轏
轜
轟
轢
车
轧
轨
轩
轪
轫
转
轭
轮
软
轰
轱
轲
轳
轴
轶
轷
轸
轹
轻
轼
载
轾
轿
较
辄
辅
辆
辇
辈
辉
辊
辋
辍
辎
辏
辐
辑
输
辔
辕
辖
辗
辘
辙
辚
辛
辜
辞
辟
辠
辣
辨
辩
辫
辭
辰
辱
農
辳
边
辺
辻
込
辽
达
迁
迂
迄
迅
过
迈
迌
迎
运
近
迓
返
迕
迗
还
这
进
远
违
连
迟
迢
迣
迤
迥
迦
迨
迩
迪
迫
迭
迮
述
迳
迴
迵
迷
迸
迹
迺
追
退
送
适
逃
逄
逅
逆
选
逊
逋
逍
透
逐
逑
递
途
逖
逗
這
通
逛
逝
逞
速
造
逡
逢
連
逦
逧
逫
逭
逮
逯
逰
進
逵
逶
逸
逺
逻
逼
逾
遀
遁
遂
遄
遇
遊
運
遍
過
遏
遐
遑
遒
道
達
違
遖
遗
遘
遙
遚
遛
遜
遠
遡
遢
遣
遤
遥
遨
適
遭
遮
遲
遴
遵
遷
選
遹
遺
遽
遾
避
邀
邁
邂
邃
還
邈
邊
邋
邑
邒
邓
邕
邗
邙
邛
邝
邟
邡
邢
那
邦
邨
邪
邬
邮
邯
邰
邱
邳
邴
邵
邶
邸
邹
邺
邻
邽
邾
郀
郁
郄
郅
郇
郈
郉
郊
郌
郎
郏
郐
郑
郓
郗
郛
郜
郝
郞
郡
郢
郤
郦
郧
部
郪
郫
郭
郯
郴
郷
郸
郺
郻
都
郾
郿
鄂
鄄
鄅
鄇
鄉
鄐
鄑
鄕
鄘
鄙
鄚
鄜
鄞
鄟
鄠
鄢
鄣
鄤
鄫
鄯
鄱
鄳
鄷
鄸
鄹
鄼
酁
酃
酆
酉
酊
酋
酌
配
酎
酏
酐
酒
酓
酔
酗
酚
酛
酜
酝
酞
酟
酡
酣
酤
酥
酧
酩
酪
酬
酭
酮
酯
酰
酱
酲
酵
酶
酷
酸
酹
酽
酾
酿
醄
醅
醇
醉
醋
醌
醍
醐
醑
醒
醔
醗
醚
醛
醣
醤
醦
醪
醭
醮
醯
醴
醵
醺
釂
釆
采
釈
釉
释
釋
里
重
野
量
金
釜
針
釟
釠
釥
釧
釮
釲
釴
釸
釺
釼
釿
鈈
鈍
鈒
鈓
鈗
鈙
鈜
鈞
鈤
鈩
鈪
鈯
鈴
鉄
鉊
鉎
鉏
鉓
鉘
鉠
鉢
鉣
鉪
鉱
鉴
鉹
鉾
銀
銃
銆
銈
銍
銎
銒
銕
銗
銡
銧
銭
銮
銱
銷
鋆
鋈
鋐
鋒
鋠
鋩
鋴
鋷
鋺
鋼
錄
錅
錌
錠
錦
錨
錩
錪
錫
錬
錯
録
錼
錾
鍂
鍃
鍊
鍑
鍕
鍖
鍛
鍞
鍨
鍩
鍪
鍱
鍴
鍵
鍾
鎁
鎇
鎌
鎏
鎑
鎖
鎛
鎥
鎧
鎮
鎯
鎱
鏉
鏊
鏐
鏕
鏖
鏚
鏡
鏧
鐄
鐆
鐊
鐌
鐑
鐘
鐜
鐝
鐧
鐭
鐱
鐵
鐼
鐾
鑇
鑑
鑒
鑖
鑚
鑩
鑪
鑫
鑬
鑴
鑼
钅
钆
钇
针
钉
钊
钋
钍
钎
钏
钐
钒
钓
钔
钕
钖
钗
钘
钙
钚
钛
钜
钝
钞
钟
钠
钡
钢
钣
钤
钥
钦
钧
钨
钩
钪
钬
钭
钮
钯
钰
钱
钲
钳
钴
钵
钶
钷
钸
钹
钺
钻
钼
钽
钾
钿
铀
铁
铂
铃
铄
铅
铆
铉
铊
铋
铌
铎
铐
铑
铒
铕
铖
铗
铙
铛
铜
铝
铞
铟
铠
铡
铢
铣
铤
铧
铨
铩
铪
铫
铬
铭
铮
铯
铰
铱
铲
铳
铴
铵
银
铷
铸
铹
铺
铼
链
铿
销
锁
锂
锃
锄
锅
锆
锇
锈
锉
锊
锋
锌
锏
锐
锑
锒
锓
锔
锕
锖
锗
锘
错
锚
锛
锜
锝
锞
锟
锡
锢
锣
锤
锥
锦
锨
锩
锪
锫
锬
锭
键
锯
锰
锱
锲
锳
锴
锵
锶
锷
锸
锹
锺
锻
锾
锿
镀
镁
镂
镄
镆
镇
镈
镉
镊
镌
镍
镏
镐
镑
镒
镓
镔
镕
镖
镗
镘
镙
镚
镛
镜
镝
镞
镟
镠
镡
镢
镣
镤
镥
镦
镧
镨
镪
镫
镬
镭
镯
镰
镱
镲
镳
镴
镶
長
镺
长
門
閃
閉
開
閒
間
閟
関
閣
閪
閲
閺
闀
闅
闇
闊
闍
闖
闘
關
闝
闠
闣
闧
门
闩
闪
闫
闭
问
闯
闰
闱
闲
闳
间
闵
闶
闷
闸
闹
闺
闻
闼
闽
闾
闿
阀
阁
阂
阄
阅
阆
阇
阈
阉
阊
阋
阌
阎
阐
阑
阒
阓
阔
阕
阖
阗
阙
阚
阛
阜
阝
队
阡
阦
阪
阮
阱
防
阳
阴
阵
阶
阷
阹
阻
阿
陀
陂
附
际
陆
陇
陈
陉
陋
陌
降
限
陕
陙
陚
陛
陜
陞
陟
陡
院
陣
除
陨
险
陪
陫
陬
陭
陰
陲
陳
陴
陵
陶
陷
陸
陹
険
陼
陽
隅
隆
隈
隊
隋
隍
階
随
隐
隔
隗
隘
隙
際
障
隠
隣
隧
隨
隩
險
隭
隰
隳
隶
隹
隻
隼
隽
难
雀
雁
雄
雅
集
雇
雉
雊
雌
雍
雎
雏
雑
雒
雔
雕
雙
雛
雝
雞
雠
雡
離
難
雧
雨
雩
雪
雫
雯
雰
雲
雳
零
雷
雹
電
雼
雾
需
霁
霄
霆
震
霈
霉
霊
霍
霎
霏
霑
霓
霖
霗
霜
霞
霟
霥
霧
霭
霰
露
霸
霹
霾
靈
青
靓
靖
静
靛
靜
靝
非
靠
靡
面
靥
革
靭
靳
靴
靶
靺
靼
靿
鞁
鞅
鞋
鞌
鞍
鞑
鞒
鞔
鞘
鞚
鞠
鞣
鞦
鞧
鞨
鞫
鞬
鞭
鞯
鞲
鞴
鞺
鞿
韀
韅
韆
韋
韍
韕
韚
韡
韢
韦
韧
韩
韪
韫
韬
韭
韰
韲
音
韵
韶
韻
韽
響
頂
順
頌
預
頑
頔
領
頙
頛
頡
頢
頣
頫
頭
頲
頵
頼
頽
顄
顆
顈
題
顏
顑
顒
顔
顕
願
顚
顛
顜
顝
類
顧
顪
页
顶
顷
项
顺
须
顼
顽
顾
顿
颀
颁
颂
预
颅
领
颇
颈
颉
颊
颋
颌
颍
颏
颐
频
颓
颔
颖
颗
题
颙
颚
颛
颜
额
颞
颠
颡
颢
颤
颥
颦
颧
風
颪
颭
颸
颻
颾
飄
飉
飋
风
飏
飐
飑
飒
飓
飕
飖
飗
飘
飙
飚
飛
飞
食
飢
飣
飧
飨
飬
飲
飴
餀
餅
餆
餇
養
餍
餏
餐
餗
餠
餥
餦
館
餬
餮
餯
餴
餻
饂
饆
饇
饍
饔
饕
饣
饥
饧
饨
饩
饪
饫
饬
饭
饮
饯
饰
饱
饲
饴
饵
饶
饷
饸
饺
饼
饽
饿
馀
馁
馄
馅
馆
馈
馊
馋
馍
馏
馐
馑
馒
馓
馔
馕
首
馗
香
馠
馥
馨
馩
馪
馬
馯
馳
馶
馼
駄
駅
駆
駊
駋
駌
駓
駕
駖
駛
駝
駞
駱
駷
駹
駻
駿
騋
騎
騒
験
騙
騧
騯
騲
驅
驆
驈
驕
驚
驟
驠
驣
驩
驪
马
驭
驮
驯
驰
驱
驲
驳
驴
驵
驶
驷
驸
驹
驺
驻
驼
驽
驾
驿
骀
骁
骂
骄
骅
骆
骇
骈
骉
骊
骋
验
骍
骏
骐
骑
骓
骖
骗
骘
骚
骛
骜
骝
骞
骠
骡
骢
骤
骥
骧
骨
骩
骰
骱
骵
骶
骷
骸
骺
骼
髀
髁
髂
髄
髅
髈
髋
髌
髑
髓
體
高
髙
髜
髟
髡
髤
髦
髨
髪
髫
髬
髭
髮
髯
髹
髻
髿
鬂
鬃
鬈
鬉
鬌
鬓
鬘
鬙
鬟
鬣
鬥
鬧
鬩
鬱
鬲
鬴
鬺
鬻
鬼
鬾
鬿
魁
魂
魃
魄
魅
魆
魇
魈
魉
魍
魎
魏
魑
魔
魘
魚
魜
魝
魟
魢
魯
魸
鮀
鮃
鮎
鮖
鮛
鮥
鮫
鮮
鮷
鮹
鮼
鯉
鯏
鯓
鯚
鯟
鯤
鯨
鯸
鯺
鰃
鰆
鰇
鰋
鰖
鰤
鰮
鰴
鰵
鰸
鱁
鱃
鱄
鱇
鱓
鱗
鱜
鱫
鱮
鱲
鱹
鱼
鱿
鲁
鲂
鲅
鲆
鲇
鲈
鲉
鲊
鲋
鲌
鲍
鲎
鲑
鲒
鲔
鲗
鲛
鲜
鲟
鲠
鲡
鲢
鲣
鲤
鲥
鲦
鲧
鲨
鲩
鲫
鲭
鲮
鲯
鲰
鲱
鲲
鲳
鲵
鲶
鲷
鲸
鲻
鲽
鲿
鳀
鳂
鳃
鳄
鳅
鳆
鳇
鳉
鳊
鳌
鳍
鳎
鳏
鳐
鳑
鳔
鳕
鳖
鳗
鳙
鳜
鳝
鳞
鳟
鳠
鳢
鳤
鳥
鳨
鳩
鳳
鳴
鳷
鳽
鳾
鴀
鴄
鴉
鴎
鴓
鴞
鴩
鴭
鴴
鴸
鴹
鴻
鴿
鵆
鵇
鵑
鵝
鵞
鵢
鵣
鵰
鵲
鵺
鵼
鵽
鵾
鶃
鶄
鶏
鶖
鶡
鶥
鶪
鶯
鶲
鶳
鶴
鶹
鷀
鷁
鷄
鷅
鷆
鷇
鷌
鷗
鷢
鷦
鷪
鷹
鷺
鷽
鷿
鸈
鸉
鸌
鸍
鸏
鸖
鸘
鸜
鸟
鸠
鸡
鸢
鸣
鸥
鸦
鸨
鸩
鸪
鸫
鸬
鸭
鸮
鸯
鸰
鸱
鸲
鸳
鸵
鸶
鸷
鸸
鸹
鸺
鸻
鸽
鸾
鸿
鹁
鹂
鹃
鹄
鹅
鹆
鹇
鹈
鹉
鹊
鹋
鹌
鹍
鹎
鹏
鹐
鹑
鹓
鹕
鹗
鹘
鹙
鹚
鹛
鹜
鹞
鹡
鹣
鹤
鹦
鹧
鹨
鹩
鹪
鹫
鹬
鹭
鹮
鹰
鹲
鹳
鹾
鹿
麀
麂
麇
麋
麏
麐
麒
麓
麔
麗
麘
麚
麝
麟
麦
麧
麴
麵
麷
麸
麹
麻
麼
麽
麾
黃
黄
黉
黍
黎
黏
黐
黑
黒
黓
黔
黕
默
黙
黛
黜
黝
點
黟
黠
黡
黢
黥
黧
黪
黫
黭
黮
黯
黴
黹
黺
黻
黼
黾
鼂
鼃
鼋
鼍
鼎
鼐
鼑
鼓
鼗
鼘
鼙
鼠
鼦
鼨
鼫
鼬
鼯
鼳
鼷
鼹
鼻
鼾
齁
齄
齆
齊
齐
齑
齕
齛
齡
齩
齿
龀
龁
龂
龃
龄
龅
龆
龇
龈
龉
龊
龋
龌
龍
龎
龐
龑
龓
龙
龚
龛
龟
龠
龣
龤
龥
